examples/EmberPaperCases/FenceHeight/72ft/bb_YesFenceYesHouse_16H/a_windSim/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Which of the steps to run
castellatedMesh true;
snap            true;
addLayers       false;


// Geometry. Definition of all surfaces. All surfaces are of class
// searchableSurface.
// Surfaces are used
// - to specify refinement for any mesh cell intersecting it
// - to specify refinement for any mesh cell inside/outside/near
// - to 'snap' the mesh boundary to the surface
geometry
{
	// stl file which is created using freeCAD
    cube
	{
		type triSurfaceMesh;
		file "cube.stl";
	}
	
	// any extra area you want to refine inside the domain
    //refinementBox
    //{
    //    type searchableBox;
    //    min (2.5 0  0);
    //    max (4   1  1);
    //}
};



// Settings for the castellatedMesh generation.
castellatedMeshControls
{

    // Refinement parameters
    // ~~~~~~~~~~~~~~~~~~~~~

    // If local number of cells is >= maxLocalCells on any processor
    // switches from refinement followed by balancing
    // (current method) to (weighted) balancing before refinement.
    maxLocalCells 100000;

    // Overall cell limit (approximately). Refinement will stop immediately
    // upon reaching this number so a refinement level might not complete.
    // Note that this is the number of cells before removing the part which
    // is not 'visible' from the keepPoint. The final number of cells might
    // actually be a lot less.
    maxGlobalCells 2000000;

    // The surface refinement loop might spend lots of iterations refining just a
    // few cells. This setting will cause refinement to stop if <= minimumRefine
    // are selected for refinement. Note: it will at least do one iteration
    // (unless the number of cells to refine is 0)
    minRefinementCells 0;

    // Allow a certain level of imbalance during refining
    // (since balancing is quite expensive)
    // Expressed as fraction of perfect balance (= overall number of cells /
    // nProcs). 0=balance always.
    maxLoadUnbalance 0.10;


    // Number of buffer layers between different levels.
    // 1 means normal 2:1 refinement restriction, larger means slower
    // refinement.
    nCellsBetweenLevels 3;	// important



    // Explicit feature edge refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies a level for any cell intersected by its edges.
    // This is a featureEdgeMesh, read from constant/triSurface for now.
    features
    (
        {
            file "cube.eMesh";
            level 0;	// 2;  // 6;
        }
    );



    // Surface based refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies two levels for every surface. The first is the minimum level,
    // every cell intersecting a surface gets refined up to the minimum level.
    // The second level is the maximum level. Cells that 'see' multiple
    // intersections where the intersections make an
    // angle > resolveFeatureAngle get refined up to the maximum level.

    refinementSurfaces
    {
        cube		// name of the patch declared for the object in geometry
        {
            // Surface-wise min and max refinement level
            level (2 2);	// refinement of the grid near the surface -important
        }
    }

    // Resolve sharp angles. Should keep the value as low as possible, 
	//  can go higher with less curvature but it needs to be lower than the curvature of your object
	//resolveFeatureAngle 10;
    resolveFeatureAngle 30;		// default
	//resolveFeatureAngle 60;	// to avoid too much refinement with curvature
	
	
	planarAngle 30;


    // Region-wise refinement
    // ~~~~~~~~~~~~~~~~~~~~~~

    // Specifies refinement level for cells in relation to a surface. One of
    // three modes
    // - distance. 'levels' specifies per distance to the surface the
    //   wanted refinement level. The distances need to be specified in
    //   descending order.
    // - inside. 'levels' is only one entry and only the level is used. All
    //   cells inside the surface get refined up to the level. The surface
    //   needs to be closed for this to be possible.
    // - outside. Same but cells outside.

    refinementRegions
    {
        refinementBox
        {
            mode inside;
            levels ((1 0));  //((1E15 4));
        }
    }


    // Mesh selection
    // ~~~~~~~~~~~~~~

    // After refinement patches get added for all refinementSurfaces and
    // all cells intersecting the surfaces get put into these patches. The
    // section reachable from the locationInMesh is kept.
    // NOTE: This point should never be on a face, always inside a cell, even
    // after refinement.
	// care should be made not to choose this location inside or on the outside of any of the input .stl objects
    locationInMesh (0.5 0.5 0.5);	// VERY important


    // Whether any faceZones (as specified in the refinementSurfaces)
    // are only on the boundary of corresponding cellZones or also allow
    // free-standing zone faces. Not used if there are no faceZones.
    allowFreeStandingZoneFaces true;

	// optional: do not remove cells likely to give snapping problems
	//handleSnapProblems false;
	
	//useTopologicalSnapDetection false;

}



// Settings for the snapping.
snapControls
{
    //- Number of patch smoothing iterations before finding correspondence
    //  to surface
    nSmoothPatch 3;

    //- Relative distance for points to be attracted by surface feature point
    //  or edge. True distance is this factor times local
    //  maximum edge length.
    tolerance 2.0;

    //- Number of mesh displacement relaxation iterations.
    nSolveIter 300;	//30;

    //- Maximum number of snapping relaxation iterations. Should stop
    //  before upon reaching a correct mesh.
    nRelaxIter 5;

    // Feature snapping

        //- Number of feature edge snapping iterations.
        //  Leave out altogether to disable.
        nFeatureSnapIter 10;

        //- Detect (geometric only) features by sampling the surface
        //  (default=false).
        implicitFeatureSnap false;

        //- Use castellatedMeshControls::features (default = true)
        explicitFeatureSnap true;

        //- Detect points on multiple surfaces (only for explicitFeatureSnap)
        multiRegionFeatureSnap false;
}



// Settings for the layer addition.
addLayersControls
{
    // Are the thickness parameters below relative to the undistorted
    // size of the refined cell outside layer (true) or absolute sizes (false).
    relativeSizes true;

    // Expansion factor for layer mesh
    expansionRatio 1.2; //1.0;

    // Wanted thickness of final added cell layer. If multiple layers
    // is the thickness of the layer furthest away from the wall.
    // Relative to undistorted size of cell outside layer.
    // See relativeSizes parameter.
    finalLayerThickness 0.5; //0.3;

    // Minimum thickness of cell layer. If for any reason layer
    // cannot be above minThickness do not add layer.
    // Relative to undistorted size of cell outside layer.
    minThickness 0.1;


    // Per final patch (so not geometry!) the layer information
    layers
    {
        cube
        {
            nSurfaceLayers 4;
        }
    }


    // If points get not extruded do nGrow layers of connected faces that are
    // also not grown. This helps convergence of the layer addition process
    // close to features.
    // Note: changed(corrected) w.r.t 17x! (didn't do anything in 17x)
    nGrow 0;


    // Advanced settings

    	// When not to extrude surface. 0 is flat surface, 90 is when two faces
    	// are perpendicular
    	featureAngle 130; //60;

		// Stop layer growth on highly warped cells
		maxFaceThicknessRatio 0.5;

		// Number of smoothing iterations of surface normals
		nSmoothSurfaceNormals 1;

		// Smooth layer thickness over surface patches
		nSmoothThickness 10;

		// Angle used to pick up medial axis points
		// Note: changed(corrected) w.r.t 17x! 90 degrees corresponds to 130 in 17x.
		minMedianAxisAngle 90;

		// Reduce layer growth where ratio thickness to medial
		// distance is large
		maxThicknessToMedialRatio 0.3;

		// Number of smoothing iterations of interior mesh movement direction
		nSmoothNormals 3;

		// At non-patched sides allow mesh to slip if extrusion direction makes
		// angle larger than slipFeatureAngle.
		slipFeatureAngle 30;

		// Maximum number of snapping relaxation iterations. Should stop
		// before upon reaching a correct mesh.
		nRelaxIter 5; //3;
		
		// Create buffer region for new layer terminations
		nBufferCellsNoExtrude 0;
		
		// Overall max number of layer addition iterations. The mesher will exit
		// if it reaches this number of iterations; possibly with an illegal
		// mesh.
		nLayerIter 50;
		
		nRelaxedIter 20;	// this might not be real, might be deprecated

}



// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{
    #include "meshQualityDict"
}


// Advanced

// Write flags. The tutorial didn't have these
//writeFlags
//(
//    scalarLevels
//    layerSets
//    layerFields     // write volScalarField for layer coverage
//);


// Merge tolerance. Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance 1e-6;


// ************************************************************************* //
